-- Eventsテーブルにサンプルデータを追加
insert into public.Events (event_name, date, location)
values 
('単独ライブ', '2023-12-24', 'Zepp Haneda'),
('リリイベ1部', '2023-12-23', 'ララポート豊洲'),
('リリイベ2部', '2023-12-23', 'ララポート豊洲'),
('イベントテスト', '2023-12-20', ''),
('イベントテスト2', '2023-12-20', ''),
('イベントテスト3', '2023-12-21', ''),
('イベントテスト4', '2023-12-21', ''),
('イベントテスト5', '2023-12-21', ''),
('イベントテスト6', '2023-12-22', ''),
('イベントテスト7', '2023-12-22', ''),
('イベントテスト8', '2023-12-22', ''),
('イベントテスト9', '2023-12-23', ''),
('イベントテスト10', '2023-12-23', ''),
('イベントテスト11', '2023-12-23', ''),
('イベントテスト12', '2023-12-24', ''),
('イベントテスト13', '2023-12-24', ''),
('mumoイベント', '2023-12-24', '');

-- Event_Tag_Namesテーブルにサンプルデータを追加
insert into public.Event_Tag_Names (name)
values 
('単独ライブ'),
('リリイベ'),
('対バン'),
('メディア'),
('奈々聖'),
('瑠香'),
('美里'),
('梨々華'),
('葉月');

-- Youtube_Tag_Namesテーブルにサンプルデータを追加
insert into public.Youtube_Tag_Names (name)
values 
('4K'),
('最前'),
('全編'),
('1曲');
